crud/app/controllers/books_controller.rb

INSERT INTO "books" ("name", "address", "created_at", "updated_at", "email", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "fbkjcbfw"], ["address", ""], ["created_at", "2021-04-09 09:28:14.421054"], ["updated_at", "2021-04-09 09:28:14.421054"], ["email", ""], ["user_id", 4]]
---
  def create
    # @book = Book.new(book_params)
    @book=current_user.book.build(book_params)
    respond_to do |format|
      if @book.save

UPDATE "books" SET "contact_number" = $1, "updated_at" = $2, "age" = $3, "email" = $4 WHERE "books"."id" = $5  [["contact_number", 976], ["updated_at", "2021-04-10 09:21:33.561490"], ["age", 22], ["email", "A@gn"], ["id", 23]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def correct_user
    @book = current_user.book.find_by(id: params[:id])